# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [35]:
serie1 = pd.Series(np.random.randint(1,5,100))
serie2 = pd.Series(np.random.randint(1,4,100))
serie3 = pd.Series(np.random.randint(10000,30000,100))

In [36]:
print(serie1)
print(serie2)
print(serie3)

0     4
1     1
2     2
3     4
4     3
     ..
95    3
96    1
97    1
98    2
99    4
Length: 100, dtype: int32
0     3
1     1
2     2
3     1
4     2
     ..
95    1
96    2
97    3
98    2
99    1
Length: 100, dtype: int32
0     12026
1     15738
2     25336
3     24902
4     15208
      ...
95    18866
96    14858
97    28252
98    25492
99    23954
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [37]:
df = pd.DataFrame({'serie1': serie1, 'serie2': serie2, "serie3":serie3}, columns=['serie1', 'serie2','serie3'])

In [38]:
df

    serie1  serie2  serie3
0        4       3   12026
1        1       1   15738
2        2       2   25336
3        4       1   24902
4        3       2   15208
..     ...     ...     ...
95       3       1   18866
96       1       2   14858
97       1       3   28252
98       2       2   25492
99       4       1   23954

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [39]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       4       3            12026
1       1       1            15738
2       2       2            25336
3       4       1            24902
4       3       2            15208
..    ...     ...              ...
95      3       1            18866
96      1       2            14858
97      1       3            28252
98      2       2            25492
99      4       1            23954

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [48]:
bigcolumn = pd.DataFrame(serie1.append((serie2,serie3)))
bigcolumn

        0
0       4
1       1
2       2
3       4
4       3
..    ...
95  18866
96  14858
97  28252
98  25492
99  23954

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [59]:
bigcolumn.index[-1] == 99

True

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [73]:
bigcolumn.reset_index(inplace=True, drop=True)

In [74]:
bigcolumn

         0
0        4
1        1
2        2
3        4
4        3
..     ...
295  18866
296  14858
297  28252
298  25492
299  23954

[300 rows x 1 columns]